namespace WenYan.Service.Api
{
    /// <summary>
    /// 打印Ascll编码Log
    /// </summary>
    public static class ConsoleLogo
    {
        //打印Logo
        public static void PrintLog(this IServiceCollection services)
        {
            Console.ForegroundColor = ConsoleColor.Blue;
            Console.WriteLine(@"
      ___           ___           ___                                ___           ___     
     /\  \         /\__\         /\  \                              /\  \         /\  \    
    _\:\  \       /:/ _/_        \:\  \                  ___       /::\  \        \:\  \   
   /\ \:\  \     /:/ /\__\        \:\  \                /|  |     /:/\:\  \        \:\  \  
  _\:\ \:\  \   /:/ /:/ _/_   _____\:\  \              |:|  |    /:/ /::\  \   _____\:\  \ 
 /\ \:\ \:\__\ /:/_/:/ /\__\ /::::::::\__\             |:|  |   /:/_/:/\:\__\ /::::::::\__\
 \:\ \:\/:/  / \:\/:/ /:/  / \:\~~\~~\/__/           __|:|__|   \:\/:/  \/__/ \:\~~\~~\/__/
  \:\ \::/  /   \::/_/:/  /   \:\  \                /::::\  \    \::/__/       \:\  \      
   \:\/:/  /     \:\/:/  /     \:\  \               ~~~~\:\  \    \:\  \        \:\  \     
    \::/  /       \::/  /       \:\__\                   \:\__\    \:\__\        \:\__\    
     \/__/         \/__/         \/__/                    \/__/     \/__/         \/__/                                                                      
");
        }
    }
}
